"*con**firm" = "OK";
"can**cel" = "Cancel";
"ti**ps" = "Tips";
"for**ceStr" = "RGlzY292ZXJpbmcgYW4gdXBncmFkZWQgdmVyc2lvbiwgd2l0aG91dCBhbiB1cGdyYWRlIHdpbGwgbGVhdmUgdGhlIGFwcGxpY2F0aW9uIHVuYXZhaWxhYmxl";
"rig**htUp" = "Upgrade immediately";
"sel**ectStr" = "SWYgeW91IGRldGVjdCBhIG5ldyB2ZXJzaW9uLCBkbyB5b3Ugd2FudCB0byB0cnkgaXQgaW1tZWRpYXRlbHk/";

"per**sonal" = "Account";
"com**mun**ity" = "Community";
"item**Other" = "UGF5";
"cus**tomer"  = "Q1M=";

"pro**Ao**rdNull" = "Goods or orders are empty";
"sto**pTips" = "You prohibit the purchase permission in the App, please open in Settings";
"pro**duct no**t exi**st" = "The Commodity ID does not exist";
"bu**ying" = "SW4gcGF5bWVudC4uLg==";
"ca**ll cus**tomer" = "UGxlYXNlIGNvbnRhY3QgdGhlIGN1c3RvbWVyIHNlcnZpY2UgdG8gc3VwcGxlbWVudCB0aGUgb3JkZXI=";
"pa**y succ**ess" = "cGF5bWVudCBzdWNjZXNz";
"pa**y fa**il" = "RmFpbGVkIHRvIHBheQ==";
"pa**y can**cel" = "UGF5bWVudCBjYW5jZWxsZWQ=";

"Cen**ter Us**er" = "User Settings";
"Con**tact Cust**omer" = "Support";
"Ser**vice agre**ement" = "Terms of Service";
"log**out ga**me" = "log out";
"A**cc Can**cel" = "Delete account";
"sp**eci**al t**ip" = "Special Remind";
"can**cel mes**s**age" = "We hereby remind you that this account is the platform account of our company. If you click ”confirm Delete“, we will consider that you have successfully submitted the application for deleting the account to us, and the deletion of the account is unrecoverable.After the account is deleted, you will not be able to use the account to log in to any products and services of the company, and you cannot retrieve your personal information.";
"co**nfi**rm ca**n**cel" = "Confirm delete";
"can**cel suc**ce**ss" = "Logout success";

"bi**nd st**ring" = "Continue with";
"bi**nd acc**ount" = "Link Account";
"bi**nd suc**cess" = "Bind Success";
"ha**ve bi**nd" = "This account has been bound to the platform";
"bi**nd ti**ps" = "You are currently signed in as a guest.Bind third-party account to save your game progress.";

"tour**ists" = "Guest log in";
"c**ut acc**ount" = "Switch Accounts";
"cu**t succ**ess" = "Switch Success";
"c**ut ti**ps" = "Are you sure you want to switch the account?";

"ti**p bi**nd" = "For your account's security, please upgrade your account as soon as possible.";
"ri**ght up**grade" = "Go to Upgrade";
"ig**nore" = "skip";

"cen**ter y**ap" = "VG9wLXVwIGNlbnRlcg==";
"ou**r y**ap" = "T2ZmaWNpYWwgcmVjaGFyZ2U=";

"ha**ve re**ad" = "Please make sure you carefully read and agree to our Terms of Service ,Privacy Policy";
"te**rm of se**rvice" = "<Terms of Service>";
"Pr**ivacy Te**rms" = "<Privacy Policy>";
"ba**ck str" = "Back";
"agreement explain" = "Please ensure that you carefully read and agree to our terms of service, privacy policy, and data permission statement. Click “confirm” to start the game.
Data permission statement:
Please note that we will collect and use your data and permissions as following:
1.Account nickname, email address, your gender and device ID, and system generated user ID provided by you are used for account identification, registration, login, user nickname display, business optimization, and advertising marketing;
2.Your in-game transaction records are used for risk control, customer service, and business optimization
3.The photos, videos, and voice messages you upload are convenient for you to post, upload user center images, and set up avatars in our game;
4.Activities records your in-app for our business optimization and implementation of corresponding game functions;
5. You can contact us through our “User Center” or “Contact Us” functions to withdraw your consent to the privacy policy, refuse to provide some information that does not affect the basic functions of the game, privacy policy related issues, etc;
6. Your application crash log are used for business optimization and solving game crash problems.";

"cu**t ti**tle" = "Switch Accounts Tips";
"c**ut ti**p st**r" = "Switching accounts will log you out of the current account.";
"oth**er func**tion" = "Other";

"func**tion ti**p" = "Account Deletion:\nIf you need to deactivate your account, please click the Help button.\nAfter deactivating your account, you will not be able to recover your current account and roles, so please proceed with caution.";
"he**lp s**tr" = "Help";

"he**lp t**ip" = "Account Deletion:\n\nAfter deactivating your account, you will not be able to recover your current account and roles, so please proceed with caution.";
"can**cel Acc**ount" = "Account Deletion";
"can**cel cou**nt do**wn" = "Please read the above Account Deletion first and wait for the countdown to end";
"ag**ain confi**rm ca**ncel" = "Dear player:

Please confirm once again if you need to proceed with the account deletion. You will have 7 days to verify the account cancellation. If you log in during this period, the account cancellation request will be canceled. If there is no login within 7 days, your account will be deactivated on the eighth day. Click the delete button to proceed or the cancel button if you do not wish to deactivate your account.";

"canc**el but**ton" = "Delete";
"can**cel te**xt" = "Account Deletion

About account Deletion :
1.Ensure your device and internet connection are stable before deleting your account.
You may contact customer support if you have any questions about Account Deletion.
Please proceed with caution when deleting your account.

2.Once the deletion process is complete,you will no able to log in,use or restore your account.
All personal information stored within your account will be either deleted or anonymously stored,and
cannot be retrieved.

3.Once the deletion process is complete, all in-game currency,items,and other paid services will also be
removed.Please proceed with caution when deleting your account.

If you need to delete your account,you can click “Delete” in the lower right corner, and our customer
support team will help you verify and delete it.";
